---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailElement
source: html/54e32d4f-77c1-6359-7960-0bdb60d193a0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailElement Property

"Detail"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailElement { get; }
```